# Copyright (c) 2023, NVIDIA CORPORATION & AFFILIATES. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "detection_retinaface_ensemble"
platform: "ensemble"
max_batch_size: 64
input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "confs"
    data_type: TYPE_FP32
    dims: [ 1 ]
  },
  {
    name: "croped_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  },
  {
    name: "preprocessed_image_info"
    data_type: TYPE_INT16
    dims: [ -1 ]
  },
  {
    name: "num_obj"
    data_type: TYPE_INT16
    dims: [ 1 ]
  },
  {
    name: "box"
    data_type: TYPE_FP32
    dims: [ 4 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "detection_retinaface_preprocessing"
      model_version: -1
      input_map {
        key: "detection_retinaface_preprocessing_input"
        value: "input_image"
      }
      output_map {
        key: "detection_retinaface_preprocessing_output0"
        value: "preprocessed_image"
      }
      output_map {
        key: "detection_retinaface_preprocessing_output1"
        value: "preprocessed_image_info"
      }
    },
    {
      model_name: "detection_retinaface"
      model_version: -1
      input_map {
        key: "inputs"
        value: "preprocessed_image"
      }
      output_map {
        key: "output_0"
        value: "output_det"
      }
      output_map {
        key: "output_1"
        value: "output_cls"
      }
      output_map {
        key: "output_2"
        value: "output_landmark"
      }
    },
    {
      model_name: "detection_retinaface_postprocessing"
      model_version: -1
      input_map {
        key: "detection_retinaface_postprocessing_input_info"
        value: "preprocessed_image_info"
      }
      input_map {
        key: "detection_retinaface_postprocessing_input_det"
        value: "output_det"
      }
      input_map {
        key: "detection_retinaface_postprocessing_input_cls"
        value: "output_cls"
      }
      input_map {
        key: "detection_retinaface_postprocessing_input_landmark"
        value: "output_landmark"
      }
      input_map {
        key: "detection_retinaface_postprocessing_input_image"
        value: "input_image"
      }
      output_map {
        key: "croped_image"
        value: "croped_image"
      }
      output_map {
        key: "detection_retinaface_postprocessing_classes"
        value: "confs"
      }
      output_map {
        key: "detection_retinaface_postprocessing_numobject"
        value: "num_obj"
      }
      output_map {
        key: "detection_retinaface_postprocessing_box"
        value: "box"
      }
    }
  ]
}

