# Copyright (c) 2023, NVIDIA CORPORATION & AFFILIATES. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "ghost_face_nodet_ensemble"
platform: "ensemble"
max_batch_size: 64
input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "feature_norm"
    data_type: TYPE_FP32
    dims: [ 512 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "ghost_face_preprocessing"
      model_version: -1
      input_map {
        key: "ghost_face_preprocessing_input_image"
        value: "input_image"
      }
      output_map {
        key: "ghost_face_preprocessing_output"
        value: "input_image_transformed"
      }
    },
    {
      model_name: "ghost_face_extract_feature"
      model_version: -1
      input_map {
        key: "input_2"
        value: "input_image_transformed"
      }
      output_map {
        key: "embedding"
        value: "feature"
      }
    },
    {
      model_name: "ghost_face_postprocessing"
      model_version: -1
      input_map {
        key: "ghost_face_postprocessing_input"
        value: "feature"
      }
      output_map {
        key: "recognize_face_postprocessing_output"
        value: "feature_norm"
      }
    }
  ]
}

