7767517
100 116
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=8 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 9=2
ConvolutionDepthWise     convdwrelu_0             1 1 1 2 0=8 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72 7=8 9=2
Convolution              convrelu_1               1 1 2 3 0=16 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128 9=2
ConvolutionDepthWise     convdwrelu_1             1 1 3 4 0=16 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16 9=2
Convolution              convrelu_2               1 1 4 5 0=32 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=2
ConvolutionDepthWise     convdwrelu_2             1 1 5 6 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32 9=2
Convolution              convrelu_3               1 1 6 7 0=32 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=2
ConvolutionDepthWise     convdwrelu_3             1 1 7 8 0=32 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32 9=2
Convolution              convrelu_4               1 1 8 9 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=2
ConvolutionDepthWise     convdwrelu_4             1 1 9 10 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=2
Convolution              convrelu_5               1 1 10 11 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=2
Split                    splitncnn_0              1 2 11 12 13
ConvolutionDepthWise     convdwrelu_5             1 1 13 14 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64 9=2
Convolution              convrelu_6               1 1 14 15 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
ConvolutionDepthWise     convdwrelu_6             1 1 15 16 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=2
Convolution              convrelu_7               1 1 16 17 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
ConvolutionDepthWise     convdwrelu_7             1 1 17 18 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=2
Convolution              convrelu_8               1 1 18 19 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
ConvolutionDepthWise     convdwrelu_8             1 1 19 20 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=2
Convolution              convrelu_9               1 1 20 21 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
ConvolutionDepthWise     convdwrelu_9             1 1 21 22 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=2
Convolution              convrelu_10              1 1 22 23 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
ConvolutionDepthWise     convdwrelu_10            1 1 23 24 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128 9=2
Convolution              convrelu_11              1 1 24 25 0=128 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Split                    splitncnn_1              1 2 25 26 27
ConvolutionDepthWise     convdwrelu_11            1 1 27 28 0=128 1=3 -23310=1,1.000000e-01 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128 9=2
Convolution              convrelu_12              1 1 28 29 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=2
ConvolutionDepthWise     convdwrelu_12            1 1 29 30 0=256 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256 9=2
Convolution              convrelu_13              1 1 30 31 0=256 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=2
Convolution              convrelu_14              1 1 12 32 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=2
Convolution              convrelu_15              1 1 26 33 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=2
Convolution              convrelu_16              1 1 31 34 0=64 1=1 -23310=1,1.000000e-01 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=2
Split                    splitncnn_2              1 3 34 35 36 37
Interp                   interpolate_0            1 1 35 38 0=1 3=40 4=40 6=0
BinaryOp                 add_0                    2 1 33 38 39 0=0
Convolution              convrelu_17              1 1 39 40 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_3              1 3 40 41 42 43
Interp                   interpolate_1            1 1 41 44 0=1 3=80 4=80 6=0
BinaryOp                 add_1                    2 1 32 44 45 0=0
Convolution              convrelu_18              1 1 45 46 0=64 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=2
Split                    splitncnn_4              1 2 46 47 48
Convolution              conv_63                  1 1 48 49 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Convolution              convrelu_19              1 1 47 50 0=16 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Split                    splitncnn_5              1 2 50 51 52
Convolution              conv_65                  1 1 52 53 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              convrelu_20              1 1 51 54 0=16 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=2
Convolution              conv_67                  1 1 54 55 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Concat                   cat_0                    3 1 49 53 55 56 0=0
ReLU                     relu_40                  1 1 56 57
Split                    splitncnn_6              1 3 57 58 59 60
Convolution              conv_68                  1 1 43 61 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Convolution              convrelu_21              1 1 42 62 0=16 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Split                    splitncnn_7              1 2 62 63 64
Convolution              conv_70                  1 1 64 65 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              convrelu_22              1 1 63 66 0=16 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=2
Convolution              conv_72                  1 1 66 67 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Concat                   cat_1                    3 1 61 65 67 68 0=0
ReLU                     relu_41                  1 1 68 69
Split                    splitncnn_8              1 3 69 70 71 72
Convolution              conv_73                  1 1 37 73 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Convolution              convrelu_23              1 1 36 74 0=16 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=2
Split                    splitncnn_9              1 2 74 75 76
Convolution              conv_75                  1 1 76 77 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution              convrelu_24              1 1 75 78 0=16 1=3 -23310=1,1.000000e-01 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=2
Convolution              conv_77                  1 1 78 79 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Concat                   cat_2                    3 1 73 77 79 80 0=0
ReLU                     relu_42                  1 1 80 81
Split                    splitncnn_10             1 3 81 82 83 84
Convolution              conv_78                  1 1 60 85 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Permute                  permute_87               1 1 85 86 0=3
Reshape                  reshape_96               1 1 86 87 0=4 1=12800
Convolution              conv_79                  1 1 72 88 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Permute                  permute_88               1 1 88 89 0=3
Reshape                  reshape_97               1 1 89 90 0=4 1=3200
Convolution              conv_80                  1 1 84 91 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Permute                  permute_89               1 1 91 92 0=3
Reshape                  reshape_98               1 1 92 93 0=4 1=800
Concat                   cat_3                    3 1 87 90 93 out0 0=0
Convolution              conv_81                  1 1 59 95 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Permute                  permute_90               1 1 95 96 0=3
Reshape                  reshape_99               1 1 96 97 0=2 1=12800
Convolution              conv_82                  1 1 71 98 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Permute                  permute_91               1 1 98 99 0=3
Reshape                  reshape_100              1 1 99 100 0=2 1=3200
Convolution              conv_83                  1 1 83 101 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Permute                  permute_92               1 1 101 102 0=3
Reshape                  reshape_101              1 1 102 103 0=2 1=800
Concat                   cat_4                    3 1 97 100 103 104 0=0
Convolution              conv_84                  1 1 58 105 0=20 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1280
Permute                  permute_93               1 1 105 106 0=3
Reshape                  reshape_102              1 1 106 107 0=10 1=12800
Convolution              conv_85                  1 1 70 108 0=20 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1280
Permute                  permute_94               1 1 108 109 0=3
Reshape                  reshape_103              1 1 109 110 0=10 1=3200
Convolution              conv_86                  1 1 82 111 0=20 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1280
Permute                  permute_95               1 1 111 112 0=3
Reshape                  reshape_104              1 1 112 113 0=10 1=800
Concat                   cat_5                    3 1 107 110 113 out2 0=0
Softmax                  softmax_43               1 1 104 out1 0=1 1=1
